
## 1. 交换机的配置方式

+ 使用控制(**Console**)端口配置交换机, 常用于交换机刚出厂并进行第一次配置时所采用的模式
+ 使用**Telnet**配置交换机, 常用于远程配置模式, 该模式要求交换机已经连接到网上, 而且已配置了交换机的设备管理地址
+ 使用浏览器(**IE**)配置交换机, 主要用于交换机被设置成Web服务器, 然后通过网络上的任意一个终端站点使用浏览器对交换机进行配置

## 2. 配置交换机的系统信息

+ 交换机的基本配置一般都是通过**使用Console端口配置方式**完成, 配置的主要内容有配置交换机的主机名、超级用户口令、设备管理地址和远程登录口令
+ 关于交换机配置命令语句, 主要是以Cisco IOS(35系列)和Catalyst OS(65系列)两种交换机操作系统来讲解
+ 那么常考的配置命令语句有**设置系统时间、配置设备管理P地址**

### 2.1 设置系统时间

#### 2.1.1 Cisco IOS系统(35系列)

命令格式: **`clock set hh(时) : mm(分) : ss (秒) day (日) month(月) year(年)`**

设置系统时间为2018年8月28日12时的命令如下:
```
Switch-3528-TEST # clock set 12 ∶ 00 : 00 28 August 2018
```


#### 2.1.2 Catalyst OS(65系列)

命令格式: **`set time [ day_of_ week ] [ mm/dd/yy ] [ hh : mm : ss ]`**

设置系统时间为2018年8月28日12时星期三的命令如下:
```
Switch-6509-TEST>(enable) set time Wed 8/28/2018 12∶00∶00
```

### 2.2 配置设备管理地址(IP地址)与缺省路由

#### 2.2.1 Cisco IOS系统(35系列)

配置IP地址命令语句: **`ip address <IP地址> <子网掩码>`**
配置缺省路由命令语句: **`ip default-gateway <缺省路由IP地址>`**

备注: VLAN1是用于设备管理的缺省VLAN

配置设备管理地址为137.189.11.76/24, 缺省路由的地址为137.189.11.1
```
Switch-3528-TEST # config terminal
Switch-3528-TEST(config) # interface vlan1
Switch-3528-TEST(config-if) # ip address 137.189.11.73 255.255.255.0
Switch-3528-TEST(config-if) # exit
Switch-3528-TEST(config) # fip default-gateway 137.189.11.1
```


#### 2.2.2Catalyst OS(65系列)

配置IP地址命令语句: **`set interface sc0 <IP地址> <子网掩码> <直接广播地址>`**
配置缺省路由命令语句: **`set ip route 0.0.0.0 <缺省路由IP地址>`**

配置设备管理地址为219.75.208.254/24, 缺省路由为219.75.208.1
```
Switch-6500>(enable) set interface sc0 219.75.208.254 255.255.255.0 219.75.208.255
Switch-6500>(enable) set ip route 0.0.0.0 219.75.208.1
```

## 3. 交换机端口配置

### 3.1 Cisco IOS系统(35系列)

1. 配置交换机的端口描述信息

步骤1: 进入端口配置模式
```
Switch-3528-TEST(config) # interface f0/1
Switch-3528-TEST(config-if)  #
```

步骤2: 配置端口描述信息
```
Switch-3528-TEST(config-if) # description To-Webserver
Switch-3528-TEST(config-if) #
```

2. 配置交换机端口的关闭与开启

步骤1: 进入端口配置模式
```
Switch-3528-TEST(config) # interface fastethernet0/1
Switch-3528-TEST(config-it) #
```

步骤2: 关闭或开启端口
```
Switch-3528-TFST(config-it) # shutdown (关闭端口)
Switch-3528-TEST(config-it) # no shutdown (开启端口, 使端口处于工作状态)
Switch-3528-TFST(config-if) #
```

3. 配置交换机端口的通信方式

```
Switch-3528-TEST(config-if) # duplex auto (设置为自动协商（自适应），默认为此种方式)
Switch-3528-TEST(config-if) # duplex full (设置为全双工)
Switch-3528-TEST(config-if) # duplex half (设置为半双工)
```

4. 配置端口的传输速率

```
Switch-3528-TEST(config-if) # auto (设置端口为自动速率配置)
Switch-3528-TEST(config-if) # speed 10 (设置端口速率为10Mbit/s)
Switch-3528-TEST(config-if) # speed 100 (设置端口速率为100Mbit/s)
Switch-3528-TEST(config-if) #
```

### 3.2 Cisco IOS系统(35系列)

1. 配置交换机的端口描述信息

命令格式: `set port name <modport> <name>`
其中, name为端口描述, 字符数一般不超过240个

```
Switch-6509-TEST>(enable) set port name 0/1 to-Webserver
Switch-6509-TEST>(enable)
```

2. 配置交换机端口的关闭与开启

命令格式: 
`set port disable <mod/port> (关闭端口)`
`set port enable <mod/port> (开启端口)`

```
Switch-6509-TEST>(enable) set port disable 0/1 (关闭0/1号端口)
Switch-6509-TEST>(enable) set port enable 0/1 (开启0/1号端口)
```


3. 配置交换机端口的通信方式

命令格式:
`set port duplex <mod/port> full (设置为全双工)`
`set port duplex <mod/port> half (设置为半双工)`

```
Switch-6509-TEST>(enable) set port duplex 0/1 full (O/1端口设置为全双工)
Switch-6509-TEST>(enable) set port duplex 0/1 half (0/1端口设置为半双工)
```

4. 配置端口的传输速率

命令格式:
`set port speed <mod/port> auto (自适应)`
`set port speed <mod/port><port_speed> (10, 100, 1000)`

```
Switch-6509-TEST>(enable) set port speed 0/1 auto (设置端口的速率为自适应)
Switch-6509-TEST>(enable) set port speed 0/1 10 (设置端口0/1的速率为10Mbit/s)
```





