
交换机VLAN配置的主要任务是∶ 
[[#1. 建立或删除VLAN]]
[[#2. 配置VLAN Trunk]]
[[#3. 配置VTP]]
[[#4. 为交换机端口分配VLAN]]


## 1. 建立或删除VLAN

### 1.1 Cisco IOS系统(35系列)

1. 建立VLAN

命令格式: `vlan <vlan_ID > name <vlan_name>`

```
Switch-3528-TEST # vlan data
Switch-3528-TEST(vlan) # vlan 100 name vlanwork
```

2. 删除VLAN

命令格式: `no vlan <vlan_ID >`

```
switch-3528-TEST (vlan) # no vlan 100
```

修改VLAN与建立VLAN步骤完全相同

```
Switch-3528-TEST (vlan) # vlan 100 name vlanwork
Switch-3528-TEST (vlan) # vlan 100 name vlangroup
```

### 1.2 Catalyst OS(65系列)

1. 建立VLAN

命令格式: `set vlan <vlan ID> name <vlan name>`

```
Switch-6509-TEST>(enable) set vlan 100 name vlan100 (建立VLAN 100, 名称为vlan100)
```

2. 删除VLAN

命令格式: `clear vlan <vlan_num>`

```
Switch-6509-TEST> (enable) clear vlan 100 (删除VLAN 100)
```

修改VLAN命令和建立VLAN完全相同

```
Switch-6509-TEST>(enable) set vlan 100 name vlan100
Switch-6509-TEST>(enable) set vlan 100 name vlan1000
```


## 2. 配置VLAN Trunk

### 2.1 Cisco IOS系统(35系列)

步骤一∶ 进入交换机端口配置模式

```
Switch-3528-TEST # configure terminal
Switch-3528-TEST(config) # int fo/24
Switch-3528-TEST(config-if) #
```

步骤二∶ 配置VLAN Trunk模式

```
Switch-3528-TEST(config-if) # switchport mode trunk
Switch-3528-TEST(config-if) #
```

步骤三∶ 封装VLAN协议

```
Switch-3528-TEST(config-if) # switchport trunk encapsulation dotl q (配置VLAN Trunk的封装模式为802.1q) *
Switch-3528-TEST(config-if) # switchport trunk encapsulation isl (封装ISL协议)
Switch-3528-TEST(config-if) # switchport trunk encapsulation negotiate P (自动协商)
```

步骤四∶ 设置允许中继的VLAN

```
Switch-3528-TEST(config-if) # switchport trunk allowed vlan 1,10 (允许VLAN l和VLAN 10通过此Trunk通路) *
Switch-3528-TEST(config-if) # switchport trunk allowed vlan 1-10
Switch-3528-TEST(config-if) # switchport trunk allowed vlan except 11-20 (except: 除去)
```

### 2.2 Catalyst OS(65系列)

步骤一: 配置VLAN Trunk模式, 封装VLAN协议

命令格式: `set trunk <mod/port> <mode> <type>`

```
Switch-6509-TEST>(enable) set trunk 1/24 on dotlq
```

步骤二∶ 设置允许中继的VLAN
命令格式: 
`set trunk <mod/port> vlan <vlan id> (设置允许中继的VLAN)`
`clear trunk <mod/port> <vlan id> (删除允许中继的VLAN)`

```
Switch-6509-TEST>(enable) set trunk 1/24 vlan 11-20 (在端口1/24的允许VLAN列表中添加11~20号vlan)
```


## 3. 配置VTP

VTP是VLAN中继协议, 也被称为VALN干道协议. 它是一个OSI参考模型第二层的通信协议, 主要用于管理在同一个域的网络范围内VLANs的建立、删除和重命名

配置VTP的任务主要有两个: 
1. 建立VTP域
2. 设置VTP的工作模式

注意: 同一个域的所有交换机, 必须运行相同版本的VTP, 并具有相同的域名

VTP工作模式:
1. VTP Server: 一般, 一个VTP域内的整个网络只设一个VTP Server, 它**维护该VTP域中所有VLAN信息列表, 可以建立、删除或修改VLAN**
2. VTPClient: 也维护所有VLAN信息列表, 但是它的**VLAN信息是从VTPServer学习到的, 并且不具有建立、删除或修改VLAN的功能**
3. VTPTransparent: 相当于一个独立的交换机, 它不参与VTP工作, 不从VTPServer学习VLAN的配置信息, 而只拥有本设备上自己的VLAN信息, 因此它也**只能建立、删除和修改本机上的VLAN信息**

### 3.1 Cisco IOS系统(35系列)

1. 配置VTP域名

设置VTP域名为TEST, 同一个域的所有交换机, 必须设置相同的域名, 同时VTP协议的版本号必须一致
```
Switch-3528-TEST # configure terminal (进入工作模式)
Switch-3528-TEST(config) # vtp domain TEST
```

2. 配置VTP工作模式

```
Switch-3528-TEST(config) # vtp mode server (设置为VTP Server模式, 默认值)
Switch-3528-TEST(config) # vtp mode client (设置为VTP Client模式)
Switch-3528-TEST(config) # vtp mode transparent（设置为VTP Transparent模式)
Switch-3528-TEST(config) #
```

### 3.2 Catalyst OS(65系列)

1. 配置VTP域名

```
Switch-6509-TEST>(enable) servtp domain_TEST (设置VTP域名为TEST)
```

2. 配置VTP工作模式。

```
Switch-6509-TEST>(enable) set vtp mode server (设置为VTP Server模式, 默认值)
Switch-6509-TEST>(enable) set vtp mode client (设置为VTP Client模式)
Switch-6509-TEST>(enable) set vtp mode transparent (设置为VTP Transparent模式)
```

## 4. 为交换机端口分配VLAN

### 4.1 Cisco IOS系统(35系列)

步骤一: 进入端口配置模式

```
Switch-3528-TEST # configure terminal
Switch-3528-TEST(config) # int f0/1
Switch-3528-TEST(config-if) #
```

步骤二∶ 为端口分配VLAN

命令格式: `switchport access vlan <vlan-num>`

```
Switch-3528-TEST(config-if) # switchport access vlan 100（将端口f0/1划分到VLAN 100中)
Switch-3528-TEST(config-if) #
```

### 4.2 Catalyst OS(65系列)

命令格式: `set vlan <vlan-num> <mod/port>`

```
Switch-6509-TEST>(enable) set vlan 100 0/1(将端口0/1划分到VLAN 100中)
Switch-6509-TEST>(enable)
```






